#enum of roles
import enum

class Constants(enum.Enum):

    TEAM_CODE_1 = "193853"
    TEAM_CODE_2 = "256278"
    TEAM_CODE_3 = "387527"
    TEAM_CODE_4 = "402283"

    FIRST_ROUND_CODE = "19281948"
    SECOND_ROUND_CODE = "748512"
    THIRD_ROUND_CODE = "391443"
    FOURTH_ROUND_CODE = "924678"
    FIFTH_ROUND_CODE = "516899"

    TEXT_1 = """Дорогие выпускники❗️

Срочное сообщение! Вентиляционная система дала сбой. Инженеры починили ее, но аварийная система перекрыла подачу кислорода. Система оборудована тремя уровнями защиты, и для того, чтобы получить доступ к ней, необходимо взломать шифр на каждом уровне. Думаем, расшифровка послания содержит 10 цифр 🖌


1. Первая ступень защиты:  
 
D “eje ujl gktctym d if.jhfnjhbb ghbdtkf r cgfctyb, vbkkbjyjd 
 
2. Вторая ступень защиты:  
 
3 31 20 16 20 4 16 5 21 14 1 13 10 17 6 18 3 16 6 21 19 20 18 16 11 19 20 3 16 19 12 16 20 16 18 29 14  14 16 8 15 16 17 18 6 5 16 20 3 18 1 20 10 20 30 9 1 18 1 8 6 15 10 6 3 10 18 21 19 16 14 
 
3. Пятая ступень защиты: 
 
Дджёкфж д грфв срумжёрдвфжнюппр гжй стргжнв шэцтэ кй сжтдрл к гфртрл уфхсжпк


Ответить получится лишь после расшифровки каждого шифра, и, до скорой встречи👋"""
    TEXT_2 = """Нам стало поступать много жалоб на недомогание и головную боль. Мы переживаем, что вирус мог просочиться в бункер. Если это действительно произошло, нам необходимо срочно изолировать зараженных и продезинфицировать помещение.
    Срочно проследуйте в 116 помещение бункера."""
    TEXT_3 = """НА НАС БЫЛО СОВЕРШЕНО НАПАДЕНИЕ!!! Наш враг - крысы! 
    Несмотря на свои небольшие размеры, они способны поностью нас уничтожить. Их тактика - уничтожение провизии и распространение болезней.
    Мы должны дать отпор захватчикам! Для этого нужно добыть необходимое оборудование для борьбы с ними. Оно находится --> в хоровой. <-- Проблема в том, что крысы уже заолонили ее. Вам необходимо добыть оборудоание, избегая контакта с ними."""
    TEXT_4 = """Из нашей лаборатории на поверхности поступил доклад, что вирус в первую очередь поражает клетки головного мозга. Мы не можем допустить, чтобы вирус проник в наш бункер, поэтому вам необходимо пройти тест интеллектуальных способностей. 
    Немедленно проследуйте в 125 помещение бункера для прохождения теста."""
    TEXT_5 = """Нам необходимо провести тест – тест когнитивных функций. Пройдя этот тест, мы сможем быть уверенны в том, что наш бункер изолирован от вируса.
    Для прохождения теста пройдите в 504 помещение бункера."""
    TEXT_FINAL = "Внимание! Внимание! Сообщение от руководства бункера! Немедленно проследуйте в малый зал бункера для получение дальнейших указаний."
